In [1]:
import pandas as pd

In [2]:
s = pd.Series([10,20,30,40])
s #you can set your series explicitly

0    10
1    20
2    30
3    40
dtype: int64

In [4]:
s = pd.Series([10,20,30,40], index = ['a','b','c','d'])
s

a    10
b    20
c    30
d    40
dtype: int64

In [5]:
dict = {"name": ["john", "mary", "peter", "jeff"],
        "age": [24, 13, 53, 33],
        "cgpa": [3.4, 2.5, 3.8, 3.1]}

In [6]:
df = pd.DataFrame(dict)
df.info() #gives summary of the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      int64
 2   cgpa    4 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 228.0+ bytes

**Case Study using Pandas**

In [39]:
df = pd.read_csv('task-1.csv')

In [40]:
df.head()

,order_id,order_date,product,category,price,quantity,city,payment_method
0,1001,2024-01-05,Laptop,NaN,120000,1,Karachi,Credit Card
1,1002,2024-01-06,Mobile Phone,Electronics,60000,2,Lahore,Cash on Delivery
2,1003,2024-01-07,Headphones,Accessories,5000,3,Islamabad,Debit Card
3,1004,2024-01-10,Office Chair,Furniture,25000,1,khi,Credit Card
4,1005,2024-02-02,Laptop,Electronics,120000,1,Lahore,Credit Card

In [41]:
df.tail()

,order_id,order_date,product,category,price,quantity,city,payment_method
6,1007,2024-02-15,Mobile Phone,Electronics,60000,1,Karachi,Debit Card
7,1008,2024-03-01,Monitor,Electronics,30000,2,Lahore,Credit Card
8,1009,2024-03-05,Headphones,Accessories,5000,4,KARACHI,Cash on Delivery
9,1010,2024-03-10,Desk Lamp,Accessories,3000,2,Islamabad,Debit Card
10,1010,2024-03-10,Desk Lamp,Accessories,3000,2,Islamabad,Debit Card

In [42]:
df.shape

(11, 8)

In [43]:
df.isnull()

,order_id,order_date,product,category,price,quantity,city,payment_method
0,False,False,False,True,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
5,False,False,False,False,False,False,False,False
6,False,False,False,False,False,False,False,False
7,False,False,False,False,False,False,False,False
8,False,False,False,False,False,False,False,False
9,False,False,False,False,False,False,False,False
10,False,False,False,False,False,False,False,False

In [44]:
df.dtypes

order_id           int64
order_date        object
product           object
category          object
price              int64
quantity           int64
city              object
payment_method    object
dtype: object

In [45]:
df.describe()

          order_id          price   quantity
count    11.000000      11.000000  11.000000
mean   1005.909091   42818.181818   1.818182
std       3.176619   43618.386448   0.981650
min    1001.000000    3000.000000   1.000000
25%    1003.500000    5000.000000   1.000000
50%    1006.000000   30000.000000   2.000000
75%    1008.500000   60000.000000   2.000000
max    1010.000000  120000.000000   4.000000

Data Cleaning and Feature Engineering

In [46]:
df.isna().sum()

order_id          0
order_date        0
product           0
category          1
price             0
quantity          0
city              0
payment_method    0
dtype: int64

In [47]:
# Check if 'category' column exists, if not create it first
if 'category' not in df.columns:
	df['category'] = None

df[df['category'].isna()]

,order_id,order_date,product,category,price,quantity,city,payment_method
0,1001,2024-01-05,Laptop,NaN,120000,1,Karachi,Credit Card

In [48]:
df.loc[0,'category']='Electronics'

In [49]:
df.duplicated().sum()

np.int64(1)

In [50]:
df['city'] = df['city'].str.lower().str.strip()

In [51]:
df.tail()

,order_id,order_date,product,category,price,quantity,city,payment_method
6,1007,2024-02-15,Mobile Phone,Electronics,60000,1,karachi,Debit Card
7,1008,2024-03-01,Monitor,Electronics,30000,2,lahore,Credit Card
8,1009,2024-03-05,Headphones,Accessories,5000,4,karachi,Cash on Delivery
9,1010,2024-03-10,Desk Lamp,Accessories,3000,2,islamabad,Debit Card
10,1010,2024-03-10,Desk Lamp,Accessories,3000,2,islamabad,Debit Card

In [52]:
df['city'] = df['city'].replace({'khi':'karachi'})

In [53]:
df['order_date'] = pd.to_datetime(df['order_date'])

In [ ]:
df['price'] = df['price'].astype(float) #change the data type of price column to float

In [55]:
#outlier detection
df[df['price']>3000000]

Empty DataFrame
Columns: [order_id, order_date, product, category, price, quantity, city, payment_method]
Index: []

Feature Engineering

In [58]:
#existing columns to create a new column
df['total_sales'] = df['price'] * df['quantity']
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   order_id        11 non-null     int64
 1   order_date      11 non-null     datetime64[ns]
 2   product         11 non-null     object
 3   category        11 non-null     object
 4   price           11 non-null     float64
 5   quantity        11 non-null     int64
 6   city            11 non-null     object
 7   payment_method  11 non-null     object
 8   total_sales     11 non-null     float64
dtypes: datetime64[ns](1), float64(2), int64(2), object(4)
memory usage: 924.0+ bytes

In [63]:
df['sales_category'] = pd.cut(df['total_sales'], 
                              bins=[0, 2000, 50000, 100000, float('inf')], 
                              labels=['Low', 'Medium', 'High', 'Very High'])
df.head(20)

,order_id,order_date,product,category,price,quantity,city,payment_method,total_sales,sales_category
0,1001,2024-01-05,Laptop,Electronics,120000.0,1,karachi,Credit Card,120000.0,Very High
1,1002,2024-01-06,Mobile Phone,Electronics,60000.0,2,lahore,Cash on Delivery,120000.0,Very High
2,1003,2024-01-07,Headphones,Accessories,5000.0,3,islamabad,Debit Card,15000.0,Medium
3,1004,2024-01-10,Office Chair,Furniture,25000.0,1,karachi,Credit Card,25000.0,Medium
4,1005,2024-02-02,Laptop,Electronics,120000.0,1,lahore,Credit Card,120000.0,Very High
5,1006,2024-02-05,Desk,Furniture,40000.0,1,islamabad,Cash on Delivery,40000.0,Medium
6,1007,2024-02-15,Mobile Phone,Electronics,60000.0,1,karachi,Debit Card,60000.0,High
7,1008,2024-03-01,Monitor,Electronics,30000.0,2,lahore,Credit Card,60000.0,High
8,1009,2024-03-05,Headphones,Accessories,5000.0,4,karachi,Cash on Delivery,20000.0,Medium
9,1010,2024-03-10,Desk Lamp,Accessories,3000.0,2,islamabad,Debit Card,6000.0,Medium
10,1010,2024-03-10,Desk Lamp,Accessories,3000.0,2,islamabad,Debit Card,6000.0,Medium

In [66]:
df['discount'] = df['category'].map({'Electronics':0.05, #applying discount to different categories
                                     'Furniture': 0.10,
                                     'Accessories': 0.15})
df['final_sales'] = df['total_sales'] * (1-df['discount'])

In [69]:
df['month'] = df['order_date'].dt.month #extracting temporal meaning
df['weekday'] = df['order_date'].dt.day_name()

#this  can help in trend analysis and seasonal patterns

In [70]:
df['final_sales'].sum()

np.float64(554450.0)

In [71]:
df.groupby('product')['final_sales'].sum().sort_values(ascending=False)

product
Laptop          228000.0
Mobile Phone    171000.0
Monitor          57000.0
Desk             36000.0
Headphones       29750.0
Office Chair     22500.0
Desk Lamp        10200.0
Name: final_sales, dtype: float64

In [72]:
df.groupby('category')['final_sales'].sum().sort_values(ascending=False)

category
Electronics    456000.0
Furniture       58500.0
Accessories     39950.0
Name: final_sales, dtype: float64

In [73]:
df.groupby('city')['final_sales'].sum().sort_values(ascending=False)

city
lahore       285000.0
karachi      210500.0
islamabad     58950.0
Name: final_sales, dtype: float64

Task 2

Quiz 1 (10)
Quiz 2 (10)
Assignment (20)
midterm (30)
attendance (%)

Feature Engineering
1. Total score
2. grade using pd.cut
3. Pass/Fail flag based on total score

No negative marking

In [ ]:
import pandas as pd

In [75]:
df = pd.read_csv('task-2.csv')
df

,student_id,name,course,quiz1,quiz2,assignment,midterm,final,attendance,semester
0,4001,Ali Khan,Mathematics,8.0,7.0,18.0,25,45.0,90,1
1,4002,Sara Ahmed,Physics,7.0,NaN,15.0,20,40.0,85,1
2,4003,Omar Malik,Chemistry,9.0,8.0,NaN,28,48.0,95,1
3,4004,Ayesha Khan,Mathematics,6.0,5.0,14.0,22,NaN,80,1
4,4005,Usman Iqbal,Physics,11.0,7.0,18.0,26,49.0,105,1
5,4006,Hina Raza,Chemistry,8.0,8.0,17.0,27,-10.0,92,1
6,4007,Zain Ali,Mathematics,7.0,7.0,16.0,23,44.0,88,1
7,4008,Nadia Khan,Physics,NaN,6.0,15.0,21,39.0,82,1
8,4009,Fahad Iqbal,Chemistry,8.0,7.0,16.0,25,47.0,90,1
9,4010,Maryam Ali,Mathematics,7.0,6.0,14.0,22,42.0,80,1
10,4011,Ali Khan,Mathematics,8.0,7.0,18.0,25,45.0,90,1
11,4012,Hassan Raza,Physics,6.0,5.0,13.0,20,38.0,75,1
12,4013,Fatima Malik,Chemistry,9.0,8.0,19.0,30,50.0,98,1
13,4014,Omar Khan,Mathematics,5.0,6.0,12.0,18,35.0,70,1
14,4015,Sara Ahmed,Physics,7.0,7.0,15.0,21,40.0,85,1

In [76]:
df.head()

,student_id,name,course,quiz1,quiz2,assignment,midterm,final,attendance,semester
0,4001,Ali Khan,Mathematics,8.0,7.0,18.0,25,45.0,90,1
1,4002,Sara Ahmed,Physics,7.0,NaN,15.0,20,40.0,85,1
2,4003,Omar Malik,Chemistry,9.0,8.0,NaN,28,48.0,95,1
3,4004,Ayesha Khan,Mathematics,6.0,5.0,14.0,22,NaN,80,1
4,4005,Usman Iqbal,Physics,11.0,7.0,18.0,26,49.0,105,1

In [77]:
df.tail()

,student_id,name,course,quiz1,quiz2,assignment,midterm,final,attendance,semester
10,4011,Ali Khan,Mathematics,8.0,7.0,18.0,25,45.0,90,1
11,4012,Hassan Raza,Physics,6.0,5.0,13.0,20,38.0,75,1
12,4013,Fatima Malik,Chemistry,9.0,8.0,19.0,30,50.0,98,1
13,4014,Omar Khan,Mathematics,5.0,6.0,12.0,18,35.0,70,1
14,4015,Sara Ahmed,Physics,7.0,7.0,15.0,21,40.0,85,1

In [79]:
df.shape

(15, 10)

In [90]:
df.loc[1,'quiz2']= df['quiz2'].mean()
df

,student_id,name,course,quiz1,quiz2,assignment,midterm,final,attendance,semester
0,4001,Ali Khan,Mathematics,8.0,7.000000,18.0,25,45.0,90,1
1,4002,Sara Ahmed,Physics,7.0,6.714286,15.0,20,40.0,85,1
2,4003,Omar Malik,Chemistry,9.0,8.000000,NaN,28,48.0,95,1
3,4004,Ayesha Khan,Mathematics,6.0,5.000000,14.0,22,NaN,80,1
4,4005,Usman Iqbal,Physics,11.0,7.000000,18.0,26,49.0,105,1
5,4006,Hina Raza,Chemistry,8.0,8.000000,17.0,27,-10.0,92,1
6,4007,Zain Ali,Mathematics,7.0,7.000000,16.0,23,44.0,88,1
7,4008,Nadia Khan,Physics,NaN,6.000000,15.0,21,39.0,82,1
8,4009,Fahad Iqbal,Chemistry,8.0,7.000000,16.0,25,47.0,90,1
9,4010,Maryam Ali,Mathematics,7.0,6.000000,14.0,22,42.0,80,1
10,4011,Ali Khan,Mathematics,8.0,7.000000,18.0,25,45.0,90,1
11,4012,Hassan Raza,Physics,6.0,5.000000,13.0,20,38.0,75,1
12,4013,Fatima Malik,Chemistry,9.0,8.000000,19.0,30,50.0,98,1
13,4014,Omar Khan,Mathematics,5.0,6.000000,12.0,18,35.0,70,1
14,4015,Sara Ahmed,Physics,7.0,7.000000,15.0,21,40.0,85,1

In [93]:
df.loc[4,'quiz1']= df['quiz1'].mean()

In [94]:
df.loc[7,'quiz1']= df['quiz1'].mean()
df

,student_id,name,course,quiz1,quiz2,assignment,midterm,final,attendance,semester
0,4001,Ali Khan,Mathematics,8.000000,7.000000,18.0,25,45.0,90,1
1,4002,Sara Ahmed,Physics,7.000000,6.714286,15.0,20,40.0,85,1
2,4003,Omar Malik,Chemistry,9.000000,8.000000,NaN,28,48.0,95,1
3,4004,Ayesha Khan,Mathematics,6.000000,5.000000,14.0,22,NaN,80,1
4,4005,Usman Iqbal,Physics,7.326531,6.714286,18.0,26,49.0,105,1
5,4006,Hina Raza,Chemistry,8.000000,8.000000,17.0,27,-10.0,92,1
6,4007,Zain Ali,Mathematics,7.000000,7.000000,16.0,23,44.0,88,1
7,4008,Nadia Khan,Physics,7.309038,6.000000,15.0,21,39.0,82,1
8,4009,Fahad Iqbal,Chemistry,8.000000,7.000000,16.0,25,47.0,90,1
9,4010,Maryam Ali,Mathematics,7.000000,6.000000,14.0,22,42.0,80,1
10,4011,Ali Khan,Mathematics,8.000000,7.000000,18.0,25,45.0,90,1
11,4012,Hassan Raza,Physics,6.000000,5.000000,13.0,20,38.0,75,1
12,4013,Fatima Malik,Chemistry,9.000000,8.000000,19.0,30,50.0,98,1
13,4014,Omar Khan,Mathematics,5.000000,6.000000,12.0,18,35.0,70,1
14,4015,Sara Ahmed,Physics,7.000000,7.000000,15.0,21,40.0,85,1

In [95]:
df.loc[2,'assignment']= df['assignment'].mean()
df

,student_id,name,course,quiz1,quiz2,assignment,midterm,final,attendance,semester
0,4001,Ali Khan,Mathematics,8.000000,7.000000,18.000000,25,45.0,90,1
1,4002,Sara Ahmed,Physics,7.000000,6.714286,15.000000,20,40.0,85,1
2,4003,Omar Malik,Chemistry,9.000000,8.000000,15.714286,28,48.0,95,1
3,4004,Ayesha Khan,Mathematics,6.000000,5.000000,14.000000,22,NaN,80,1
4,4005,Usman Iqbal,Physics,7.326531,6.714286,18.000000,26,49.0,105,1
5,4006,Hina Raza,Chemistry,8.000000,8.000000,17.000000,27,-10.0,92,1
6,4007,Zain Ali,Mathematics,7.000000,7.000000,16.000000,23,44.0,88,1
7,4008,Nadia Khan,Physics,7.309038,6.000000,15.000000,21,39.0,82,1
8,4009,Fahad Iqbal,Chemistry,8.000000,7.000000,16.000000,25,47.0,90,1
9,4010,Maryam Ali,Mathematics,7.000000,6.000000,14.000000,22,42.0,80,1
10,4011,Ali Khan,Mathematics,8.000000,7.000000,18.000000,25,45.0,90,1
11,4012,Hassan Raza,Physics,6.000000,5.000000,13.000000,20,38.0,75,1
12,4013,Fatima Malik,Chemistry,9.000000,8.000000,19.000000,30,50.0,98,1
13,4014,Omar Khan,Mathematics,5.000000,6.000000,12.000000,18,35.0,70,1
14,4015,Sara Ahmed,Physics,7.000000,7.000000,15.000000,21,40.0,85,1

In [96]:
df.loc[3,'final']= df['final'].mean()
df

,student_id,name,course,quiz1,quiz2,assignment,midterm,final,attendance,semester
0,4001,Ali Khan,Mathematics,8.000000,7.000000,18.000000,25,45.000000,90,1
1,4002,Sara Ahmed,Physics,7.000000,6.714286,15.000000,20,40.000000,85,1
2,4003,Omar Malik,Chemistry,9.000000,8.000000,15.714286,28,48.000000,95,1
3,4004,Ayesha Khan,Mathematics,6.000000,5.000000,14.000000,22,39.428571,80,1
4,4005,Usman Iqbal,Physics,7.326531,6.714286,18.000000,26,49.000000,105,1
5,4006,Hina Raza,Chemistry,8.000000,8.000000,17.000000,27,-10.000000,92,1
6,4007,Zain Ali,Mathematics,7.000000,7.000000,16.000000,23,44.000000,88,1
7,4008,Nadia Khan,Physics,7.309038,6.000000,15.000000,21,39.000000,82,1
8,4009,Fahad Iqbal,Chemistry,8.000000,7.000000,16.000000,25,47.000000,90,1
9,4010,Maryam Ali,Mathematics,7.000000,6.000000,14.000000,22,42.000000,80,1
10,4011,Ali Khan,Mathematics,8.000000,7.000000,18.000000,25,45.000000,90,1
11,4012,Hassan Raza,Physics,6.000000,5.000000,13.000000,20,38.000000,75,1
12,4013,Fatima Malik,Chemistry,9.000000,8.000000,19.000000,30,50.000000,98,1
13,4014,Omar Khan,Mathematics,5.000000,6.000000,12.000000,18,35.000000,70,1
14,4015,Sara Ahmed,Physics,7.000000,7.000000,15.000000,21,40.000000,85,1

In [97]:
df.loc[5,'final']= df['final'].mean()

In [99]:
df.loc[4,'attendance']= df['attendance'].mean()
df

C:\Users\Sumba\AppData\Local\Temp\ipykernel_11588\2671872184.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '85.8' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df.loc[4,'attendance']= df['attendance'].mean()

,student_id,name,course,quiz1,quiz2,assignment,midterm,final,attendance,semester
0,4001,Ali Khan,Mathematics,8.000000,7.000000,18.000000,25,45.000000,90.0,1
1,4002,Sara Ahmed,Physics,7.000000,6.714286,15.000000,20,40.000000,85.0,1
2,4003,Omar Malik,Chemistry,9.000000,8.000000,15.714286,28,48.000000,95.0,1
3,4004,Ayesha Khan,Mathematics,6.000000,5.000000,14.000000,22,39.428571,80.0,1
4,4005,Usman Iqbal,Physics,7.326531,6.714286,18.000000,26,49.000000,85.8,1
5,4006,Hina Raza,Chemistry,8.000000,8.000000,17.000000,27,39.428571,92.0,1
6,4007,Zain Ali,Mathematics,7.000000,7.000000,16.000000,23,44.000000,88.0,1
7,4008,Nadia Khan,Physics,7.309038,6.000000,15.000000,21,39.000000,82.0,1
8,4009,Fahad Iqbal,Chemistry,8.000000,7.000000,16.000000,25,47.000000,90.0,1
9,4010,Maryam Ali,Mathematics,7.000000,6.000000,14.000000,22,42.000000,80.0,1
10,4011,Ali Khan,Mathematics,8.000000,7.000000,18.000000,25,45.000000,90.0,1
11,4012,Hassan Raza,Physics,6.000000,5.000000,13.000000,20,38.000000,75.0,1
12,4013,Fatima Malik,Chemistry,9.000000,8.000000,19.000000,30,50.000000,98.0,1
13,4014,Omar Khan,Mathematics,5.000000,6.000000,12.000000,18,35.000000,70.0,1
14,4015,Sara Ahmed,Physics,7.000000,7.000000,15.000000,21,40.000000,85.0,1

Feature Engineering

In [101]:
#existing columns to create a new column
df['total_score'] = df['quiz1'] + df['quiz2'] + df['assignment'] + df['midterm'] + df['final']
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   student_id   15 non-null     int64
 1   name         15 non-null     object
 2   course       15 non-null     object
 3   quiz1        15 non-null     float64
 4   quiz2        15 non-null     float64
 5   assignment   15 non-null     float64
 6   midterm      15 non-null     int64
 7   final        15 non-null     float64
 8   attendance   15 non-null     float64
 9   semester     15 non-null     int64
 10  total_score  15 non-null     float64
dtypes: float64(6), int64(3), object(2)
memory usage: 1.4+ KB

In [102]:
df

,student_id,name,course,quiz1,quiz2,assignment,midterm,final,attendance,semester,total_score
0,4001,Ali Khan,Mathematics,8.000000,7.000000,18.000000,25,45.000000,90.0,1,103.000000
1,4002,Sara Ahmed,Physics,7.000000,6.714286,15.000000,20,40.000000,85.0,1,88.714286
2,4003,Omar Malik,Chemistry,9.000000,8.000000,15.714286,28,48.000000,95.0,1,108.714286
3,4004,Ayesha Khan,Mathematics,6.000000,5.000000,14.000000,22,39.428571,80.0,1,86.428571
4,4005,Usman Iqbal,Physics,7.326531,6.714286,18.000000,26,49.000000,85.8,1,107.040816
5,4006,Hina Raza,Chemistry,8.000000,8.000000,17.000000,27,39.428571,92.0,1,99.428571
6,4007,Zain Ali,Mathematics,7.000000,7.000000,16.000000,23,44.000000,88.0,1,97.000000
7,4008,Nadia Khan,Physics,7.309038,6.000000,15.000000,21,39.000000,82.0,1,88.309038
8,4009,Fahad Iqbal,Chemistry,8.000000,7.000000,16.000000,25,47.000000,90.0,1,103.000000
9,4010,Maryam Ali,Mathematics,7.000000,6.000000,14.000000,22,42.000000,80.0,1,91.000000
10,4011,Ali Khan,Mathematics,8.000000,7.000000,18.000000,25,45.000000,90.0,1,103.000000
11,4012,Hassan Raza,Physics,6.000000,5.000000,13.000000,20,38.000000,75.0,1,82.000000
12,4013,Fatima Malik,Chemistry,9.000000,8.000000,19.000000,30,50.000000,98.0,1,116.000000
13,4014,Omar Khan,Mathematics,5.000000,6.000000,12.000000,18,35.000000,70.0,1,76.000000
14,4015,Sara Ahmed,Physics,7.000000,7.000000,15.000000,21,40.000000,85.0,1,90.000000

In [105]:
df['grade'] = pd.cut(df['total_score'], 
                              bins=[20, 50, 75, 100, 115 ,float('inf')], 
                              labels=['E', 'D', 'C', 'B', 'A'])
df.head(20)

,student_id,name,course,quiz1,quiz2,assignment,midterm,final,attendance,semester,total_score,grade
0,4001,Ali Khan,Mathematics,8.000000,7.000000,18.000000,25,45.000000,90.0,1,103.000000,B
1,4002,Sara Ahmed,Physics,7.000000,6.714286,15.000000,20,40.000000,85.0,1,88.714286,C
2,4003,Omar Malik,Chemistry,9.000000,8.000000,15.714286,28,48.000000,95.0,1,108.714286,B
3,4004,Ayesha Khan,Mathematics,6.000000,5.000000,14.000000,22,39.428571,80.0,1,86.428571,C
4,4005,Usman Iqbal,Physics,7.326531,6.714286,18.000000,26,49.000000,85.8,1,107.040816,B
5,4006,Hina Raza,Chemistry,8.000000,8.000000,17.000000,27,39.428571,92.0,1,99.428571,C
6,4007,Zain Ali,Mathematics,7.000000,7.000000,16.000000,23,44.000000,88.0,1,97.000000,C
7,4008,Nadia Khan,Physics,7.309038,6.000000,15.000000,21,39.000000,82.0,1,88.309038,C
8,4009,Fahad Iqbal,Chemistry,8.000000,7.000000,16.000000,25,47.000000,90.0,1,103.000000,B
9,4010,Maryam Ali,Mathematics,7.000000,6.000000,14.000000,22,42.000000,80.0,1,91.000000,C
10,4011,Ali Khan,Mathematics,8.000000,7.000000,18.000000,25,45.000000,90.0,1,103.000000,B
11,4012,Hassan Raza,Physics,6.000000,5.000000,13.000000,20,38.000000,75.0,1,82.000000,C
12,4013,Fatima Malik,Chemistry,9.000000,8.000000,19.000000,30,50.000000,98.0,1,116.000000,A
13,4014,Omar Khan,Mathematics,5.000000,6.000000,12.000000,18,35.000000,70.0,1,76.000000,C
14,4015,Sara Ahmed,Physics,7.000000,7.000000,15.000000,21,40.000000,85.0,1,90.000000,C

In [ ]:
df['percentage'] = (df['total_score']/120) * 100  
df

,student_id,name,course,quiz1,quiz2,assignment,midterm,final,attendance,semester,total_score,grade,percentage
0,4001,Ali Khan,Mathematics,8.000000,7.000000,18.000000,25,45.000000,90.0,1,103.000000,B,85.833333
1,4002,Sara Ahmed,Physics,7.000000,6.714286,15.000000,20,40.000000,85.0,1,88.714286,C,73.928571
2,4003,Omar Malik,Chemistry,9.000000,8.000000,15.714286,28,48.000000,95.0,1,108.714286,B,90.595238
3,4004,Ayesha Khan,Mathematics,6.000000,5.000000,14.000000,22,39.428571,80.0,1,86.428571,C,72.023810
4,4005,Usman Iqbal,Physics,7.326531,6.714286,18.000000,26,49.000000,85.8,1,107.040816,B,89.200680
5,4006,Hina Raza,Chemistry,8.000000,8.000000,17.000000,27,39.428571,92.0,1,99.428571,C,82.857143
6,4007,Zain Ali,Mathematics,7.000000,7.000000,16.000000,23,44.000000,88.0,1,97.000000,C,80.833333
7,4008,Nadia Khan,Physics,7.309038,6.000000,15.000000,21,39.000000,82.0,1,88.309038,C,73.590865
8,4009,Fahad Iqbal,Chemistry,8.000000,7.000000,16.000000,25,47.000000,90.0,1,103.000000,B,85.833333
9,4010,Maryam Ali,Mathematics,7.000000,6.000000,14.000000,22,42.000000,80.0,1,91.000000,C,75.833333
10,4011,Ali Khan,Mathematics,8.000000,7.000000,18.000000,25,45.000000,90.0,1,103.000000,B,85.833333
11,4012,Hassan Raza,Physics,6.000000,5.000000,13.000000,20,38.000000,75.0,1,82.000000,C,68.333333
12,4013,Fatima Malik,Chemistry,9.000000,8.000000,19.000000,30,50.000000,98.0,1,116.000000,A,96.666667
13,4014,Omar Khan,Mathematics,5.000000,6.000000,12.000000,18,35.000000,70.0,1,76.000000,C,63.333333
14,4015,Sara Ahmed,Physics,7.000000,7.000000,15.000000,21,40.000000,85.0,1,90.000000,C,75.000000

In [125]:
sum = df.groupby('course')['total_score'].sum().sort_values(ascending=False)
sum

course
Mathematics    556.428571
Physics        456.064140
Chemistry      427.142857
Name: total_score, dtype: float64

In [ ]:
students = df.groupby('student_id')['grade']